name: "pipeline"
backend: "python"
max_batch_size: 0

input [
  {
    name: "raw_image"
    data_type: TYPE_FP32
    dims: [-1,-1,3]
  }
]

output [
{
    name: "photo"
    data_type: TYPE_UINT8
    dims: [-1,-1,3]
  },
  {
    name: "mrz"
    data_type: TYPE_STRING
    dims: [-1]
  }
]
