name: "ocr_preprocess"
backend: "python"
max_batch_size: 0

input [
  {
    name: "roi"
    data_type: TYPE_FP32
    dims: [ -1,-1,3 ]
  }
]

output [
  {
    name: "preprocessed_image"
    data_type: TYPE_FP32
    dims: [-1,3,48,-1]
  }
]